## Terraform Plan Results 🚀

#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_zero_trust_access_application.zt will be created
  + resource "cloudflare_zero_trust_access_application" "zt" {
      + app_launcher_visible       = true
      + aud                        = (known after apply)
      + destinations               = (known after apply)
      + domain                     = "gspc.digital/zt"
      + http_only_cookie_attribute = true
      + id                         = (known after apply)
      + name                       = "zt"
      + self_hosted_domains        = (known after apply)
      + session_duration           = "24h"
      + type                       = "self_hosted"
      + zone_id                    = "864cd8a523c95bf08961fcbbfe0513b6"
    }

  # cloudflare_zone.gspc will be created
  + resource "cloudflare_zone" "gspc" {
      + account               = {
          + id = "075dfe0421fbb29f90fb7ae88e2804fa"
        }
      + activated_on          = (known after apply)
      + cname_suffix          = (known after apply)
      + created_on            = (known after apply)
      + development_mode      = (known after apply)
      + id                    = (known after apply)
      + meta                  = (known after apply)
      + modified_on           = (known after apply)
      + name                  = "gspc.digital"
      + name_servers          = (known after apply)
      + original_dnshost      = (known after apply)
      + original_name_servers = (known after apply)
      + original_registrar    = (known after apply)
      + owner                 = (known after apply)
      + paused                = false
      + permissions           = (known after apply)
      + plan                  = (known after apply)
      + status                = (known after apply)
      + tenant                = (known after apply)
      + tenant_unit           = (known after apply)
      + type                  = "full"
      + vanity_name_servers   = (known after apply)
      + verification_key      = (known after apply)
    }

  # cloudflare_zone.gspc_finance will be created
  + resource "cloudflare_zone" "gspc_finance" {
      + account               = {
          + id = "075dfe0421fbb29f90fb7ae88e2804fa"
        }
      + activated_on          = (known after apply)
      + cname_suffix          = (known after apply)
      + created_on            = (known after apply)
      + development_mode      = (known after apply)
      + id                    = (known after apply)
      + meta                  = (known after apply)
      + modified_on           = (known after apply)
      + name                  = "gspc.finance"
      + name_servers          = (known after apply)
      + original_dnshost      = (known after apply)
      + original_name_servers = (known after apply)
      + original_registrar    = (known after apply)
      + owner                 = (known after apply)
      + paused                = false
      + permissions           = (known after apply)
      + plan                  = (known after apply)
      + status                = (known after apply)
      + tenant                = (known after apply)
      + tenant_unit           = (known after apply)
      + type                  = "full"
      + vanity_name_servers   = (known after apply)
      + verification_key      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @serundeputy, Action: `pull_request`, Working Directory: `.`, Workflow: `Terraform Cloudflare GitOps`*